In [22]:
import pandas as pd
import numpy as np

In [24]:
dataFrame = pd.read_excel("27-SalarySheet.xlsx")

In [26]:
dataFrame

       Employee Name            Department       Title  Salary
0       Semaj Bowers             Marketing         Mid     600
1        Gary Foster                 Sales         Mid     650
2   Saniya Maldonado                    HR         Mid     600
3     Jillian Zuniga                    HR     C-level    1000
4      Courtney Mora                 Sales         Mid     550
..               ...                   ...         ...     ...
95          Jake Gay                 Sales      Junior     443
96      Macy Webster               Finance     C-level    1250
97     Jaquan Meyers             Marketing  Mid-Senior     800
98       Willow Bush  Software Development      Junior     441
99   Emmanuel Prince                 Sales         Mid     612

[100 rows x 4 columns]

In [28]:
#1) Toplamda kaç satır veri vardır?

In [30]:
satır_sayısı=dataFrame.shape[0]#satır sayısını bulmak için 0 ise zaten axis'i ifade ediyor
print(satır_sayısı)

100

In [32]:
#2) Bu firma ortalama ne kadar maaş vermektedir?

In [34]:
dataFrame["Salary"].mean()

725.84

In [36]:
#3) Bu firmada departmanlara göre ortalama maaş karşılaştırması nasıldır?

In [38]:
group_object=dataFrame.groupby("Department")#bu sayede istediğmiz başlık altında aynı kavramları sıraladık
group_object.count()#saydık

                      Employee Name  Title  Salary
Department
Finance                          17     17      17
HR                               16     16      16
Marketing                        18     18      18
Sales                            27     27      27
Software Development             22     22      22

In [40]:
#4) Bu firmada title (senior - junior) durumuna göre ortalama maaş karşılaştırması nasıldır?

In [42]:
object2=dataFrame.groupby("Title")
object2.mean(numeric_only=True)#eğer içeriye numeric only vermeseydik hata alırdık,her satırın ortalamasını almaya çalışır

                 Salary
Title
C-level     1058.333333
Junior       440.625000
Mid          641.450000
Mid-Senior   725.500000
Senior       867.777778

In [44]:
#5) Senior bir kişinin junior bir kişiye göre maaşı ortalama yüzde kaç fazladır?

In [55]:
867.77/440.625

1.9694070921985816

In [14]:
#6) Software development departmanında senior bir kişinin junior bir kişiye göre maaşı ortalama ne kadar fazladır?

In [63]:
dataFrame.loc[dataFrame["Department"]=="Software Development"].groupby("Title").mean(numeric_only=True)#loc satırlar üzerinden işlem yaparak SD yi aldık

                 Salary
Title
C-level     1183.333333
Junior       430.333333
Mid          633.333333
Mid-Senior   718.333333
Senior       895.000000

In [16]:
#7) Finance departmanında c-level bir kişinin mid-senior bir kişiye göre maaşı ortalama ne kadar fazladır?

In [73]:
dataFrame[dataFrame["Department"]=="Finance"].groupby("Title").mean(numeric_only=True)

             Salary
Title
C-level     1030.00
Junior       469.00
Mid          691.25
Mid-Senior   790.00
Senior      1000.00

In [18]:
#8) Software development departmanında c-level çalışan sayısı marketing departmanında çalışana oranla kaç kat fazladır?

In [81]:
dataFrame.loc[dataFrame["Department"]=="Marketing"].groupby("Title").describe()#describle her şeyi bulursun

           Salary                                                            \
            count         mean         std     min     25%     50%      75%
Title
C-level       2.0  1125.000000  176.776695  1000.0  1062.5  1125.0  1187.50
Junior        3.0   461.333333   25.423087   439.0   447.5   456.0   472.50
Mid           6.0   637.833333   74.351642   550.0   600.0   612.5   681.25
Mid-Senior    4.0   675.000000  125.830574   500.0   650.0   700.0   725.00
Senior        3.0   855.000000  221.528779   600.0   782.5   965.0   982.50


               max
Title
C-level     1250.0
Junior       489.0
Mid          752.0
Mid-Senior   800.0
Senior      1000.0